# Read Baby Name Data

### Task 1

How many columns are there?
3 Columns

How are columns separated?
Seperated by Commas

Is there a header on top of the files?
No

### Task 2
Read the file 'yob2021.txt' into pandas.

In [ ]:
import pandas as pd

In [35]:
df = pd.read_csv(
    'names/yob2021.txt',
    sep=',',
    names=['Name','Gender','Amount'], #set columns names
    header=None
)

### Task 3
Print the first 10 rows.

In [106]:
df.head(10)

        Name Gender  Amount
0     Olivia      F   17728
1       Emma      F   15433
2  Charlotte      F   13285
3     Amelia      F   12952
4        Ava      F   12759
5     Sophia      F   12496
6   Isabella      F   11201
7        Mia      F   11096
8     Evelyn      F    9434
9     Harper      F    8388

### Task 4
Display the number of rows and columns.

In [21]:
df.count()[0]
# Rows

31536

In [30]:
row_count = len(df.axes[0])
row_count

31536

In [29]:
# Columns
col_count = len(df.axes[1])
col_count

3

### Task 5
Calculate the total number of babies born in 2021, i.e. the sum of the third column.

In [37]:
df['Amount'].sum()

3361375

### Task 6
Like Task 5, but calculate the sum for boys and girls separately.

In [51]:
gender_list = df.set_index('Gender')

In [52]:
females = gender_list.loc['F']
females['Amount'].sum()

1627098

In [53]:
males = gender_list.loc['M']
males['Amount'].sum()

1734277

### Task 7
Check if your name occurs in the data.

In [63]:
df['Name']
df[df.eq("Tim").any(1)]

      Name Gender  Amount
20495  Tim      M      42

### Task 8
Calculate the percentage of girls and boys among the total births.

In [74]:
percent_males = (males['Amount'].sum() / df['Amount'].sum()) * 100
percent_males

51.59427317689933

In [76]:
percent_females = (females['Amount'].sum() / df['Amount'].sum()) * 100
percent_females

48.405726823100665

In [77]:
percent_females + percent_males

100.0

### Task 9
Create a table that contains the top 5 girls names and top 5 boys names.

In [89]:
males_sorted = males.sort_values(by=['Amount'], ascending=False)
females_sorted = females.sort_values(by=['Amount'], ascending=False)

In [101]:
top_males = males_sorted.iloc[0:5, 0:2]
top_males

          Name  Amount
Gender
M         Liam   20272
M         Noah   18739
M       Oliver   14616
M       Elijah   12708
M        James   12367

In [102]:
top_females = females_sorted.iloc[0:5]
top_females

             Name  Amount
Gender
F          Olivia   17728
F            Emma   15433
F       Charlotte   13285
F          Amelia   12952
F             Ava   12759

In [103]:
top_names = pd.concat([top_females, top_males])
top_names

             Name  Amount
Gender
F          Olivia   17728
F            Emma   15433
F       Charlotte   13285
F          Amelia   12952
F             Ava   12759
M            Liam   20272
M            Noah   18739
M          Oliver   14616
M          Elijah   12708
M           James   12367

### Task 10
Write the data from task 9 to an Excel spreadsheet.

In [104]:
top_names.to_excel("top_names.xlsx")